{
  "text": "Um I must say I never expected a report card of the PAP performance and uh G 2025. So I will respond as how the uh minister delivered his speech in that order as far as I can. Uh the minister made a point about at the conclusion of elections the PAP will work hard for those who did not vote for it as well. I second that position because immediately when the results were announced when I thanked voters of Aljunet GRC I made the same point to the voters in Aljun GRC you may not have voted for the workers party about 40% of them did not my commitment to them as was the commitment I made to them in 2020 was we would serve them equally taking that as my my preamble the first point I'd like to make is about um a point I know the BAP hops on a lot which is a demand for alternative policies, ideas uh and so forth and minister spoke about mature democracies. He used the example of the political systems in the United Kingdom in Germany real choices. Uh I think we have to look at both these societies as what they are and how deep the political uh systems are compared to ours. We've had a one party dominant system since independence. Uh these two societies are very different. So it is inevitable that alternatives would be a key function of what each of these parties be democratic socialist, Christian socialist, labor conservative, what they bring to the voter in their societies. Our system is very different. We deal with significant uh asymmetries of information. Uh and minister I move on to the the next point minister made. He made it a bit earlier about the WP in his view in his opinion deliberately choosing to contest less than one/ird of the seats. Now um we had roughly I would if I remember correctly one and a half months uh from the time the electoral boundary report was released and nomination day thereabouts. In that time uh the opposition it's specifically the workers party we have got to organize the individuals we have the members we have and persuade them to stand for general elections it is a short period of time uh and in that period of time you also have to deal with the reality of new SMC's sometimes new GRC's so we are not clairvoyant. Unlike the government, we don't have the capacity to conduct survey after survey to understand where the population is on certain issues. So the realities are quite different. But in spite of that, I take the minister's point that Singaporeans want an alternative. And since they want an alternative, uh we do our best to present it to them. Um, we put together uh some collaterals for members of the public to review, uh, put together a manifesto where we defer from the PAP and put together our ideas uh, for the voter to consider. Um I disagree with the minister when he says uh there's no chance of an opposition wipe out in the circumstances that the PAP is in and the opposition are in in Singapore given uh the tremendous resources that are available to the PAP to reach out on a dayto-day level in the constituency uh through the people's association for example it is chalk and cheese >> Mr. Singh, if I could invite you to kindly progress to your clarifications. >> Sure. I >> rather than preamble it with a long speech. I have uh listened very carefully. I'm trying to thread through what you are saying based on what Minister has said. I think you can get to your clarifications in a little bit more efficient manner. So I invite you to go to your clarifications, >> Mr. Singh. Thank you. So my clarification uh really has been already shared in terms of the minister's uh view of uh whether there was a deliberate decision made to contest fewer seats. Like I said, we're not clairvoyant. We put the best people we can find forward and present uh what we can in the circumstances to represent an alternative for Singaporeans. Uh the last point uh the last clarification actually that I uh would like to put forth was with regard to what was shared with the minister in the podcast where I think the words are why can't everyone work together. I thought the minister used a very interesting analogy which I probably wouldn't. Uh jaw jaw in war war if I remember was used by churchill in the in the in a very uh aggressive way. I would say the question that we face as a society now uh is is a little simpler. We are at a very uh interesting juncture uh important transition in our history as a country. Are we prepared to accept? Is the PAP government prepared to accept for example uh an opposition member of parliament who has the mandate from the public welcoming new citizens into Singapore? Is the government prepared to allow opposition MPs to be present and to welcome these new citizens as part of our society because that would reflect a certain maturity that I believe uh is where Singapore has arrived and I if I can be so bold it may well be something that Singaporeans demand of the PAP. So I hope we can as much as the PAP wants us to consider alternatives which I think you're entitled to I think the PAP should also consider from the workers party's perspective how we can be more united as a people. >> Mr. Singh if I could kindly request you to summarize your last point. I think you've gone a little bit further than what the content of Minister's speech was. I've given you leeway. Please summarize your last clarification in order for Minister Onen to reply if he so wishes. Thank you. >> So I I would suggest that there is scope for as much as there is scope for alternatives from the opposition, there is scope for the PAP also uh to play a part in building a more united Singapore with the opposition in mind. Thank you. Minister Oni Kong, would you like to respond to those clarifications? >> Oh, certainly. Uh, it's not quite presented as clarification. So, I'll try to respond in general. The people demands many things of us both as ruling party as well as opposition. I took a step. I think the people will increasingly demand alternatives, coherent alternatives from WP. Put together principles, philosophies. What is your vision? What's the pathway? How do we get there? What is a set of policies? And to your credit, from time to time, you have mentioned some of them. But I think the people will demand coherent set of consistent policies and principles and they will demand likewise BAP to do better. And for all their demands, we will have to reflect what can we do better for the people. The leader of opposition mentioned a couple of his pet peeves. One is uh boundaries come out. a month and a half before the election. I I should say this. I think most PAP MPs in this house when the boundary reports come out, everyone scramble. They're all smiling. We are equally scrambling. Whenever the boundaries come out, suddenly you have a SMC, suddenly you have to form another division, redeploy your volunteers. We may have a slight advantage or an advantage because we contest. We are present in every constituencies. So maybe there's an advantage there. But we are also scrambling every time boundary reports come out. But we know it's necessary. Population changes, new developments. Group of civil servants look at the data and they propose new boundaries. We have to let them do their job and adapt to it. Leader opposition mentioned PA and citizenship ceremony. I I would just say under the constitution and the law and elected MPs have two functions. One is to be a legislator in this house. The other is to manage the town council. There's no PA. PA and grassroots work is a policy of the PAP government that we decided to set up a statutory board, gather as many volunteers as we can, engage the ground, bring communities together, help the children grow up well, help parents cope with parenting, helps the seniors stay healthy, promote exercise. None of this is in the law or constitution, but we do that to help our our constituency and our residents. Citizenship ceremony is one such event. I do not know of any country where you become a new citizen, the grassroots hold an event and talk to you about being Singaporean, what it means and then sing the national anthem and gather together. So these are all part of the PAP policy is to engage the ground. Um the leader of opposition talk about no chance of a wipeout. I think in the hearts of Singaporeans, they know that there's no chance of a wipeout. And reading the ground, we know there's no chance of a wipeout. The desire for a check on the PAP is very strong precisely because we have a good majority and that desire is so strong. uh we we see cases all the time like I me like what I mentioned the couple at the store friendly to us like what we are doing want you to be government want me to continue as health minister but I'm not voting for you yeah I need to support the opposition you have a role here the opposition has a role in the governance of Singapore and we have to take that seriously and accept there's no chance of a wipe out this there we it will take there's no equilibrium there's it's a dynamic balance from term to term people will have a different balance in their mind but we must accept that people now want a PAP government for now they want a PAP government but they also want an opposition presence the Mr. Singh talked about our circumstances being different from UK or US. 1963 this was a much smaller chamber with 13 Barisan socialist members minority small minority uh but they stood for different vision with different sets of policies. They disagree with the PAP on big issues of the day. Mergure with Malaysia, teaching of language, particularly Chinese national service. After 65, of course, is then become PAP dominant. But over the years, we saw WP came some way from one to two single seats. You now have two GRC's plus a couple of single seats and two NCMP. Uh we are now leader of the opposition. There's no chance of a wipeout in our view and people expect WP to play an important role and in this GE G 2025 you were quite close to winning another two GRC. Next election, no doubt you will be even more tough. And when you have come this far, I do believe the people will demand and Singapore will need you to come out with alternate policies as in the past Barisan Socialist did with a small number of seats. I think this is I I say all this not that I wish it come true but should WP really rise to the occasion and do this and be able to stand uh and contest the ruling party as the Democrats and Republicans do each other in the US or Tories and Labor do each other in UK. Actually life will be harder for PAP. You know contests will be so much more intense. People will be so much more discerning with who they choose. But I think it is the right political direction for Singapore. Focus our energy. I take your point about Jojo and war. We are not really fighting but we are arguing. We are presenting different views. We are arguing the merits and trade-offs of those directions and those visions and Singaporeans choose. If we focus our energy on such discourse, I think it's the right direction for Singapore."
}